packages/seurvalencia/seurvalencia-0.0.5-py3-none-any.whl/seurvalencia/template/get_city.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <CabeceraAutenticacion xmlns="http://seurvalencia.es/IC/SERVICE/">
      <Username>${username}</Username>
      <Password>${password}</Password>
    </CabeceraAutenticacion>
  </soap:Header>
  <soap:Body>
    <wsObtenerPoblaciones xmlns="http://seurvalencia.es/IC/SERVICE/">
      <CP_Nombre>${zip}</CP_Nombre>
      <IncluyeSinonimos>1</IncluyeSinonimos>
    </wsObtenerPoblaciones>
  </soap:Body>
</soap:Envelope>
